"""
Сформировать (не программно) текстовый файл. В нём каждая строка должна описывать учебный предмет и наличие лекционных,
практических и лабораторных занятий по предмету. Сюда должно входить и количество занятий. Необязательно, чтобы для
каждого предмета были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести его на экран.
Примеры строк файла:
Информатика:   100(л)   50(пр)   20(лаб).
Физика:   30(л)   —   10(лаб)
Физкультура:   —   30(пр)   —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""
with open('task_5_6.txt', encoding='utf-8') as f:
    dict_lesson = {}
    for i in f:
        lesson, time = i.split(':')
        dict_lesson[lesson] = sum(map(int, ''.join([el for el in time if el.isdigit() or el == ' ']).split()))
    print(dict_lesson)
