"""
Создать вручную и заполнить несколькими строками текстовый файл, в котором каждая строка будет содержать данные о фирме:
название, форма собственности, выручка, издержки.
Пример строки файла: firm_1   ООО   10000   5000.
Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль. Если фирма получила
убытки, в расчёт средней прибыли её не включать.
Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
Если фирма получила убытки, также добавить её в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:
[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
"""
import json
with open('task_5_7.json', 'w', encoding='utf-8') as f_json:
    with open('task_5_7.txt', encoding='utf-8') as f:
        dict_firm = {i.split()[0]: (int(i.split()[2]) - int(i.split()[3])) for i in f}
        res = [i for i in dict_firm.values() if i > 0]
        res_json = [dict_firm, {'average_profit': round(sum(res)/len(res))}]
        json.dump(res_json, f_json, ensure_ascii=False, indent=4)
